<a href="https://colab.research.google.com/github/Arjun-coder5/Python-Data-science-library/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***Pandas Start***

**import pandas**

In [6]:
import pandas as pd
import numpy as np

# Series from List :

In [7]:
# String
country = ['India','pak','USA','Nepal','ShriLanka']
pd.Series(country)

0        India
1          pak
2          USA
3        Nepal
4    ShriLanka
dtype: object

In [8]:
# Integer :
runs = [13,12,24,56,78,100]
pd.Series(runs)

0     13
1     12
2     24
3     56
4     78
5    100
dtype: int64

In [9]:
# Custom index :
marks = [45,34,23,45]
subject = ['maths','science','english','social']
pd.Series(marks,index= subject)

maths      45
science    34
english    23
social     45
dtype: int64

In [10]:
# Setting a Name :
marks  =pd.Series(marks,index= subject , name  = "Marks")
marks

maths      45
science    34
english    23
social     45
Name: Marks, dtype: int64

# ***Series from Dict :***

In [11]:
marks = {
    'maths' : 83,
    'english' :93,
    'Science' : 92
}

marks_series = pd.Series(marks,name = 'Marks')
marks_series

maths      83
english    93
Science    92
Name: Marks, dtype: int64

# ***Series Attributes :***

In [12]:
# Size :
marks_series.size

3

In [ ]:
# dtype :
marks_series.dtype

dtype('int64')

In [ ]:
# name :
marks_series.name

'Marks'

In [ ]:
# is_unique :
# marks_series.is_unique
pd.Series([1,1,1,1]).is_unique

False

In [13]:
# index :
marks_series.index

Index(['maths', 'english', 'Science'], dtype='object')

In [ ]:
# value :
marks_series.values

array([83, 93, 92])

# ***Series Using read_csv***

In [32]:
# With one column
subs = pd.read_csv('/content/subs.csv').squeeze("columns")
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [41]:
# With two column
vk = pd.read_csv('/content/kohli_ipl.csv',index_col='match_no').squeeze('columns')
vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [37]:
movies = pd.read_csv('/content/bollywood.csv',index_col="movie").squeeze('columns')
movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

# ***Series Methods***

In [39]:
# head and Tail :
subs.head()

0    48
1    57
2    40
Name: Subscribers gained, dtype: int64

In [42]:
vk.head(3)

match_no
1     1
2    23
3    13
Name: runs, dtype: int64

In [62]:
vk.tail(7)

match_no
209    58
210    30
211     0
212    20
213    73
214    25
215     7
Name: runs, dtype: int64

In [51]:
# Sample :
movies.sample()

movie
Apna Sapna Money Money    Bobby Darling
Name: lead, dtype: object

In [53]:
# value_counts -> movies
movies.value_counts()

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [61]:
#  sort_values -> inplace
vk.sort_values(ascending=False).head(1).values[0]

np.int64(113)

In [63]:
# sort_index -> inplace -> movies
movies.sort_index()

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object